# coding=utf-8

import random

# Response when asking for COD method
class ResponseBy():
    def asking_cod_list():
        asking_cod_list = [
            "มีเก็บปลายทางจ้าคุณพี่\nมีค่าจัดส่งและค่าบริการเพิ่มนะจ้า",
            "เก็บปลายทางก็มีจ้าคุณพี่\nมีค่าจัดส่งและค่าบริการเพิ่มนะจ้า",
            "เก็บปลายทางได้จ้า\nแต่จะมีค่าจัดส่งและค่าบริการเพิ่มนะจ้าคุณพี่",
            "เก็บปลายทางได้จ้าคุณพี่\nแต่จะมีค่าจัดส่งและค่าบริการเพิ่มนะจ้า",
            "มีจ้าคุณพี่ แต่จะมีค่าจัดส่งและค่าบริการเพิ่มนะจ้า",
            "ปลายทางก็มีจ้า แต่จะมีค่าจัดส่งและค่าบริการเพิ่มนะจ้าคุณพี่",
        ]
        yield random.choice(asking_cod_list)


    # Response when asking for more products
    def asking_more_list():
        asking_more_list = [
            "มีจ้าคุณพี่",
            "มีแบบอื่นให้เลือกนะจ้า",
            "มีแบบอื่นอยู่นะจ้าพี่",
            "มีจ้าพี่",
            "มีแบบอื่นนะจ้าพี่",
            "มีแบบอื่นให้เลือกจ้าคุณพี่",
        ]
        yield random.choice(asking_more_list)


    # Response when asking for price
    def asking_price_list():
        asking_price_list = [
            "เดี๋ยวน้องแจ้งราคาให้นะจ้า",
            "น้องขอแจ้งราคาให้สักครู่นะจ้า",
            "เดี๋ยวรีบแจ้งราคาให้เลยนะจ้า",
            "เดี๋ยวน้องส่งราคาพร้อมรายละเอียดให้นะจ้า",
            "น้องขอแจ้งราคาพร้อมรายละเอียดให้เลยนะจ้า",
            "เดี๋ยวน้องแจ้งราคาพร้อมรายละเอียดให้เลยนะจ้า",
        ]
        yield random.choice(asking_price_list)


    # Response when asking for size
    def asking_size_list():
        asking_size_list = [
            "เดี๋ยวน้องแจ้งรายละเอียดชุดพร้อมราคาให้นะจ้า",
            "น้องขอแจ้งรายละเอียดชุดพร้อมราคาให้สักครู่นะจ้า",
            "เดี๋ยวรีบแจ้งรายละเอียดชุดพร้อมราคาให้เลยนะจ้า",
            "เดี๋ยวน้องส่งรายละเอียดชุดพร้อมราคาให้นะจ้า",
            "น้องขอแจ้งรายละเอียดกับราคาชุดให้เลยนะจ้า",
            "เดี๋ยวน้องแจ้งรายละเอียดพร้อมราคาชุดให้เลยนะจ้า",
        ]
        yield random.choice(asking_size_list)


    # Response when asking for big size
    def asking_bigsize_list():
        asking_bigsize_list = [
            "มีจ้าคุณพี่",
            "มีไซส์สาวอวบอยู่จ้า",
            "มีชุดบิ๊กไซส์อยู่นะจ้าคุณพี่",
            "ทางร้านมีชุดสาวอวบนะจ้า",
            "มีชุดสาวอวบอยู่นะจ้าคุณพี่",
            "ทางร้านมีชุดบิ๊กไซส์นะจ้า",
            "มีชุดบิ๊กไซส์อยู่นะจ้าคุณพี่",
        ]
        yield random.choice(asking_bigsize_list)


    # Response when answering for color
    def response_color():
        response_color = [
            "ได้จ้าคุณพี่\nเดี๋ยวน้องส่งงานจริงให้ดูนะจ้า",
            "จ้าพี่ เดี๋ยวน้องส่งงานจริงให้ดูนะจ้า",
            "ได้จ้า\nเดี๋ยวน้องส่งงานจริงให้ดูนะจ้า",
        ]
        yield random.choice(response_color)
        

    # Response for welcome word init_list
    def welcome_word_line_1():
        welcome_word_line_1 = [
            "สวัสดีจ้าคุณพี่\nยินดีต้อนรับนะจ้า🙏😍",
            "สวัสดีจ้าคุณพี่🙏❤️",
            "สวัสดีจ้าพี่🙏💖",
            "สวัสดีจ้า🙏😍",
            "ยินดีต้อนรับจ้า🙏❤️",
            "สวัสดีนะจ้าคุณพี่🙏💖"
        ]
        yield random.choice(welcome_word_line_1)

    def welcome_word_line_2():
        welcome_word_line_2 = [
            "ตอนนี้มีสินค้าพร้อมส่งนะจ้า",
            "ตอนนี้มีสินค้าพร้อมส่งน้า",
            "มีสินค้าพร้อมส่งนะจ้า",
            "มีสินค้าพร้อมส่งจ้า",
            "มีชุดพร้อมส่งจ้า",
            "ชุดนี้มีของพร้อมส่งจ้า",
        ]
        yield random.choice(welcome_word_line_2)

    def welcome_word_line_3():
        welcome_word_line_3 = [
            "คุณพี่สนใจสีอะไร\nบอกน้องได้เลยนะจ้า",
            "สนใจชุดสีอะไรบอกน้องได้เลยนะจ้า",
            "คุณพี่ชอบสีไหน\nบอกน้องได้เลยจ้า",
            "มองดูเป็นสีอะไรไว้ดีจ้า",
            "สนใจเป็นสีไหนดีจ้า",
            "มองดูเป็นสีอะไรไว้จ้า",
        ]
        yield random.choice(welcome_word_line_3)


    def please_wait():
        please_wait = [
            "รอสักครู่จ้า",
            "รอสักครู่นะจ้า",
            "สักครู่นะจ้าพี่",
            "รอแปบนะจ้าพี่",
            "รอสักครู่นะจ้าคุณพี่",
            "รอสักแปบนึงนะจ้าคุณพี่",
            "สักครู่นะจ้าคุณพี่",
            "รอแปบนะจ้าคุณพี่",
            "รอสักแปบนึงนะจ้าคุณพี่"
        ]
        yield random.choice(please_wait)


    def goto_lineadd():
        line_add = [
            "❤️  หากแม่ค้าตอบช้าทักไลน์\n👉📱@theperfectladies มาได้เลยจ้า\n\nหรือ กดลิ้งค์ด้านล่างนี้จ้า ⬇⬇⬇\n\nhttp://nav.cx/8rtmakW",
            "❤️  หากแม่ค้าตอบช้าทักไลน์@ มาได้เลยจ้า\nกดลิ้งค์ด้านล่างนี้จ้า ⬇⬇⬇\n\nhttp://nav.cx/8rtmakW\n\nหรือ @theperfectladies\nมี @ด้านหน้าด้วยนะจ้า",
        ]
        yield random.choice(line_add)


    def goto_website():
        goto_website = [
            "สามารถดูสินค้าเพิ่มเติมได้ที่เว็บไซต์นะจ้า",
            "ลองแวะเข้าชมเว็บไซส์ของทางร้านก่อนได้นะจ้า",
            "สามารถเข้าชมเว็บไซส์ของทางร้านก่อนได้จ้า",
            "ลองดูสินค้าเพิ่มเติมได้ที่นี่นะจ้า",
            "น้องแนะนำคุณพี่เข้าชมสินค้า\nในเว็บไซส์ของทางร้านก่อนได้จ้า",
            "แนะนำให้ดูสินค้าเพิ่มเติมได้ที่นี่นะจ้า",
        ]
        yield random.choice(goto_website)


    def thankful_word():
        thankful_word = [
            "จ้าคุณพี่\nขอบพระคุณมากๆเช่นกันนะจ้า 🙏",
            "ขอบพระคุณมากๆเช่นกันนะจ้า 🙏",
            "ขอบพระคุณมากนะจ้าคุณพี่ 🙏",
            "จ้าพี่\nขอบพระคุณมากๆนะจ้า 🙏",
            "จ้าคุณพี่\nขอบพระคุณมากนะจ้า 🙏",
            "จ้า ขอบพระคุณมากนะจ้าคุณพี่ 🙏",
        ]
        yield random.choice(thankful_word)

    # Found negative for bigsize
    def negative_bigsize_list():
        negative_bigsize_list = [
            "ไซส์สาวอวบ",
            "ชุดสาวอวบ",
            "ชุดบิ๊กไซส์",
            "ชุดใหญ่กว่านี้",
            "ชุดสำหรับสาวอวบ",
            "ไซส์สำหรับสาวอวบ",
            "ไซส์ใหญ่กว่านี้",
        ]
        yield random.choice(negative_bigsize_list)

    # Found aggressive messages
    def negative_list():
        negative_list = [
            "ไม่เป็นไรจ้า\nคุณพี่สนใจดูแบบอื่นเพิ่มเติมก่อนไหมจ้า",
            "ไม่เป็นไรจ้า\nคุณพี่สนใจเป็นแบบอื่นดูไหมจ้า",
            "ไม่เป็นไรจ้า\nคุณพี่สนใจเป็นแบบอื่นดูไหมจ้า",
            "ไม่เป็นไรจ้า\nร้านน้องมีแบบให้เลือกเยอะจ้า",
            "ไม่เป็นไรจ้า\nร้านน้องมีแบบให้เลือกเยอะเลยจ้า",
        ]
        yield random.choice(negative_list)


    def lovely_emoji():
        lovely_emoji = [
            "126362100881920",
            "126362117548585",
            "184023658881956",
            "383649288463177",
            "1435019936788963",
            "155884458459895",
            "184003212217334",
            "2379539295404141",
            "2379545595403511",
            "2379550602069677",
            "2379540352070702",
            "1926231210749206",
        ]
        yield random.choice(lovely_emoji)


    def bad_emoji():
        bad_emoji = [
            "184571022160553",
            "126361974215266",
            "1458993967465713",
            "392309957532983",
            "344403782622503",
            "488541014592677",
            "1747085322269386",
            "2379541818737222",
            "2379541012070636",
            "2379542265403844",
        ]
        yield random.choice(bad_emoji)

    def do_you_still_want_this():
        do_you_still_want_this = [
            "สนใจชุดนี้อยู่ไหมจ้า",
            "สนใจชุดอยู่ไหมจ้า",
            "สนใจชุดอยู่หรือเปล่าจ้า",
            "สนใจชุดอยู่มั้ยจ้าพี่",
            "สนใจชุดนี้อยู่ไหมจ้าคุณพี่",
            "ยังสนใจชุดอยู่ไหมจ้าพี่",
        ]
        yield random.choice(do_you_still_want_this)

class Price():
    # Price Summary
    def price_390_1():
        price_390_1 = ".- ยอด 390 บาท ส่งฟรี ลทบ. (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 3-5 วัน)\n\n.- ยอด 420 บาท รวมส่ง Ems (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-2 วัน)\n\n.- ยอด 440 บาท บริการ Alpha \n(เฉพาะ นนทบุรี,ปทุมธานี,สมุทรปราการ,กรุงเทพฯ; โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 460 บาท บริการ Kerry Express (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 470 บาท บริการเก็บเงินปลายทาง Thailand Post*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)\n\n.- ยอด 480 บาท บริการเก็บเงินปลายทาง Kerry Express*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)"

        yield price_390_1

    def price_390_2():
        price_390_2 = ".- ยอด 390 บาท ส่งฟรี ลทบ. (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 3-5 วัน)\n\n.- ยอด 420 บาท รวมส่ง Ems (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-2 วัน)\n\n.- ยอด 440 บาท บริการ Alpha \n(เฉพาะ นนทบุรี,ปทุมธานี,สมุทรปราการ,กรุงเทพฯ; โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 460 บาท บริการ Kerry  Express (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 470 บาท บริการเก็บเงินปลายทาง Thailand Post*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)\n\n.- ยอด 490 บาท บริการเก็บเงินปลายทาง Kerry Express*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)"

        yield price_390_2

    def price_390x2():
        price_390x2 = ".- ยอด 780 บาท ส่งฟรี ลทบ. (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 3-5 วัน)\n\n.- ยอด 810 บาท รวมส่ง Ems (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-2 วัน)\n\n.- ยอด 830 บาท บริการ Alpha \n(เฉพาะ นนทบุรี,ปทุมธานี,สมุทรปราการ,กรุงเทพฯ; โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 860 บาท บริการ Kerry  Express (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 870 บาท บริการเก็บเงินปลายทาง Thailand Post*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)\n\n.- ยอด 890 บาท บริการเก็บเงินปลายทาง Kerry Express*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)"

        yield price_390x2

    def price_450_1():
        price_450_1 = ".- ยอด 450 บาท ส่งฟรี ลทบ. (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 3-5 วัน)\n\n.- ยอด 480 บาท รวมส่ง Ems (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-2 วัน)\n\n.- ยอด 500 บาท บริการ Alpha \n(เฉพาะ นนทบุรี,ปทุมธานี,สมุทรปราการ,กรุงเทพฯ; โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 520 บาท บริการ Kerry  Express (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 530 บาท บริการเก็บเงินปลายทาง Thailand Post*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)\n\n.- ยอด 550 บาท บริการเก็บเงินปลายทาง Kerry Express*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)"

        yield price_450_1

    def price_490_1():
        price_490_1 = ".- ยอด 490 บาท ส่งฟรี ลทบ. (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 3-5 วัน)\n\n.- ยอด 520 บาท รวมส่ง Ems (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-2 วัน)\n\n.- ยอด 540 บาท บริการ Alpha \n(เฉพาะ นนทบุรี,ปทุมธานี,สมุทรปราการ,กรุงเทพฯ; โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 560 บาท บริการ Kerry  Express (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 570 บาท บริการเก็บเงินปลายทาง Thailand Post*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)\n\n.- ยอด 590 บาท บริการเก็บเงินปลายทาง Kerry Express*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)"

        yield price_490_1
        
    def price_550_1():
        price_550_1 = ".- ยอด 550 บาท ส่งฟรี ลทบ. (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 3-5 วัน)\n\n.- ยอด 580 บาท รวมส่ง Ems (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-2 วัน)\n\n.- ยอด 600 บาท บริการ Alpha \n(เฉพาะ นนทบุรี,ปทุมธานี,สมุทรปราการ,กรุงเทพฯ; โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 620 บาท บริการ Kerry  Express (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 630 บาท บริการเก็บเงินปลายทาง Thailand Post*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)\n\n.- ยอด 650 บาท บริการเก็บเงินปลายทาง Kerry Express*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)"

        yield price_550_1

    def price_590_1():
        price_590_1 = ".- ยอด 590 บาท ส่งฟรี ลทบ. (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 3-5 วัน)\n\n.- ยอด 620 บาท รวมส่ง Ems (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-2 วัน)\n\n.- ยอด 640 บาท บริการ Alpha \n(เฉพาะ นนทบุรี,ปทุมธานี,สมุทรปราการ,กรุงเทพฯ; โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 660 บาท บริการ Kerry  Express (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 670 บาท บริการเก็บเงินปลายทาง Thailand Post*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)\n\n.- ยอด 690 บาท บริการเก็บเงินปลายทาง Kerry Express*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)"

        yield price_590_1

    def price_650_1():
        price_650_1 = ".- ยอด 650 บาท ส่งฟรี ลทบ. (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 3-5 วัน)\n\n.- ยอด 680 บาท รวมส่ง Ems (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-2 วัน)\n\n.- ยอด 700 บาท บริการ Alpha \n(เฉพาะ นนทบุรี,ปทุมธานี,สมุทรปราการ,กรุงเทพฯ; โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 720 บาท บริการ Kerry  Express (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 730 บาท บริการเก็บเงินปลายทาง Thailand Post*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)\n\n.- ยอด 750 บาท บริการเก็บเงินปลายทาง Kerry Express*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)"

        yield price_650_1

    def price_690_1():
        price_690_1 = ".- ยอด 690 บาท ส่งฟรี ลทบ. (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 3-5 วัน)\n\n.- ยอด 720 บาท รวมส่ง Ems (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-2 วัน)\n\n.- ยอด 740 บาท บริการ Alpha \n(เฉพาะ นนทบุรี,ปทุมธานี,สมุทรปราการ,กรุงเทพฯ; โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 760 บาท บริการ Kerry  Express (โอนเข้า บช.)\n(ได้รับสินค้าภายใน 1-3 วัน)\n\n.- ยอด 770 บาท บริการเก็บเงินปลายทาง Thailand Post*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)\n\n.- ยอด 790 บาท บริการเก็บเงินปลายทาง Kerry Express*COD*\n(ตัดรอบวันถัดไป ได้รับสินค้าภายใน 3-4 วัน)"

        yield price_690_1
